start_text = """
<b>👋 Привет! Я - Бот для слежки</b>

ℹ️ <b>Как пользоваться?</b>
• Добавь пользователей для мониторинга
• Смотри графики онлайна

<u>⚠️ Я нахожусь в раннем доступе, возможны ошибки</u>

✅ Если обнаружишь баг пиши в поддержку - @seeonline_support

❔ <i>Подробнее:</i> /help
"""

help_text = """
<b>🔧 Как это работает?</b>

Я слежу за онлайном пользователей и составляю графики

<i>ℹ️ График составляется со временем, 
нужно подождать пока я соберу статистику</i>

<b>🚀 Что я умею?</b>
    ✅ Отправлять графики с онлайном

<b>📝 Что находится в активной разработке?</b>
    ✏️ Оповещения смены статуса в реальном времени
    ✏️ Пересечения онлайнов разных пользователей

<i>Добавляй пользователей и я начну составлять статистику!</i>
"""