start_text = (
    "👋 <b>Привет!</b> Я — твой личный помощник по слежению за онлайном пользователей! 🕵️‍♂️\n\n"
    "📊 <b>Хочешь узнать, когда кто-то выходит в сеть?</b> Просто добавь его в список отслеживания, "
    "и я соберу для тебя <b>детальные графики активности</b>!\n\n"
    "🔍 <i>Следи за появлением в онлайне и строй свою аналитику!</i>\n\n"
    "ℹ️ <b>Нужна помощь?</b> Жми /help!"
)

help_text = (
    "ℹ️ <b>Как я работаю?</b>\n\n"
    "✅ <b>Шаг 1:</b> Добавь пользователя в список отслеживания.\n"
    "📡 <b>Шаг 2:</b> Я начну фиксировать его время в сети.\n"
    "📊 <b>Шаг 3:</b> Ты получишь <b>удобные графики</b> с его активностью!\n\n"
    "⚙️ <b>Что ещё умею?</b>\n"
    "🔔 Уведомлять, когда кто-то в сети.\n"
    "📈 Показывать статистику онлайна.\n"
    "📬 Помогать с настройками.\n\n"
    "📌 <i>Используй кнопки меню, чтобы управлять мной!</i>"
)
