start_command_text = (
    "👋 <b>Привет!</b> Этот бот отслеживает онлайн-активность пользователей и "
    "создает <b>графики их онлайна</b>.\n\n"
    "📊 <b>Хочешь узнать, когда кто-то в сети?</b> Просто добавь его в список отслеживания!\n\n"
    "ℹ️ <b>Команда помощи:</b> /help"
)

help_command_text = (
    "ℹ️ <b>Как работает бот?</b>\n\n"
    "1️⃣ <b>Добавь пользователей</b>, за которыми хочешь следить.\n"
    "2️⃣ Бот начнет фиксировать их <b>время онлайна</b>.\n"
    "3️⃣ Ты получишь <b>детальные графики активности</b>.\n\n"
    "📌 <i>Используй кнопки меню для управления ботом.</i>"
)
